// Описание: Задайте двумерный массив целых чисел. Напишите программу, которая
// находит сумму элементов в каждом столбце массива и выводит её.
// Пример входных данных:
// 1 2 3
// 4 5 6
// 7 8 9
// 10 11 12
// Пример результата:
// Сумма элементов в столбце 0: 22
// Сумма элементов в столбце 1: 26
// Сумма элементов в столбце 2: 30

class Program
{
static void FindSumInColumns(int[,] array)
{
int rows = array.GetLength(0);
int cols = array.GetLength(1);
// Введите свое решение ниже

for (int j = 0; j < cols; j++)
{   int sum = 0;
    for (int i = 0; i < rows; i++)
    {
        sum += array[i,j];
    }
    Console.WriteLine($"Сумма элементов в столбце {cols}: {sum}");
}
}
static void Main()
{
int[,] array =
{
{ 1, 2, 3 },
{ 4, 5, 6 },
{ 7, 8, 9 },
{ 10, 11, 12 }
};
FindSumInColumns(array);
}
}
